lizamashchenko/RobotManipulator/Arm.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "Wrist_Up.h"
#include "Wrist_Up_aliases.h"
#include "Wrist_Down.h"
#include "Wrist_Down_aliases.h"
#include "Elbow_Up.h"
#include "Elbow_Up_aliases.h"
#include "Elbow_Down.h"
#include "Elbow_Down_aliases.h"
#include "Shoulder_Up.h"
#include "Shoulder_Up_aliases.h"
#include "Shoulder_Down.h"
#include "Shoulder_Down_aliases.h"
#include "Gripper_In.h"
#include "Gripper_In_aliases.h"
#include "Gripper_Out.h"
#include "Gripper_Out_aliases.h"
#include "Base_1.h"
#include "Base_1_aliases.h"
#include "Base_2.h"
#include "Base_2_aliases.h"
#include "M_6_1.h"
#include "M_6_1_aliases.h"
#include "M_6_2.h"
#include "M_6_2_aliases.h"
#include "UART.h"
#include "UART_SPI_UART.h"
#include "UART_PINS.h"
#include "UART_SPI_UART_PVT.h"
#include "UART_PVT.h"
#include "UART_BOOT.h"
#include "UART_SCBCLK.h"
#include "UART_tx.h"
#include "UART_tx_aliases.h"
#include "UART_rx.h"
#include "UART_rx_aliases.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyDMA.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

